espressif/esp-idf/components/soc/esp32s3/register/soc/uart_reg.h
/** UART_AT_CMD_CHAR_REG register
 *  AT escape sequence detection configuration
 */
#define UART_AT_CMD_CHAR_REG(i) (REG_UART_BASE(i) + 0x5c)
/** UART_AT_CMD_CHAR : R/W; bitpos: [7:0]; default: 43;
 *  This register is used to configure the content of at_cmd char.
 */
#define UART_AT_CMD_CHAR    0x000000FFU
#define UART_AT_CMD_CHAR_M  (UART_AT_CMD_CHAR_V << UART_AT_CMD_CHAR_S)
#define UART_AT_CMD_CHAR_V  0x000000FFU
#define UART_AT_CMD_CHAR_S  0
/** UART_CHAR_NUM : R/W; bitpos: [15:8]; default: 3;
 *  This register is used to configure the num of continuous at_cmd chars received by
 *  receiver.
 */
#define UART_CHAR_NUM    0x000000FFU
#define UART_CHAR_NUM_M  (UART_CHAR_NUM_V << UART_CHAR_NUM_S)
#define UART_CHAR_NUM_V  0x000000FFU
#define UART_CHAR_NUM_S  8

/** UART_MEM_CONF_REG register
 *  UART threshold and allocation configuration
 */
#define UART_MEM_CONF_REG(i) (REG_UART_BASE(i) + 0x60)
/** UART_RX_SIZE : R/W; bitpos: [3:1]; default: 1;
 *  This register is used to configure the amount of mem allocated for receive-FIFO.
 *  The default number is 128 bytes.
 */
#define UART_RX_SIZE    0x00000007U
#define UART_RX_SIZE_M  (UART_RX_SIZE_V << UART_RX_SIZE_S)
#define UART_RX_SIZE_V  0x00000007U
#define UART_RX_SIZE_S  1
/** UART_TX_SIZE : R/W; bitpos: [6:4]; default: 1;
 *  This register is used to configure the amount of mem allocated for transmit-FIFO.
 *  The default number is 128 bytes.
 */
#define UART_TX_SIZE    0x00000007U
#define UART_TX_SIZE_M  (UART_TX_SIZE_V << UART_TX_SIZE_S)
#define UART_TX_SIZE_V  0x00000007U
#define UART_TX_SIZE_S  4
/** UART_RX_FLOW_THRHD : R/W; bitpos: [16:7]; default: 0;
 *  This register is used to configure the maximum amount of data that can be received
 *  when hardware flow control works.
 */
#define UART_RX_FLOW_THRHD    0x000003FFU
#define UART_RX_FLOW_THRHD_M  (UART_RX_FLOW_THRHD_V << UART_RX_FLOW_THRHD_S)
#define UART_RX_FLOW_THRHD_V  0x000003FFU
#define UART_RX_FLOW_THRHD_S  7
/** UART_RX_TOUT_THRHD : R/W; bitpos: [26:17]; default: 10;
 *  This register is used to configure the threshold time that receiver takes to
 *  receive one byte. The rxfifo_tout_int interrupt will be trigger when the receiver
 *  takes more time to receive one byte with rx_tout_en set to 1.
 */
#define UART_RX_TOUT_THRHD    0x000003FFU
#define UART_RX_TOUT_THRHD_M  (UART_RX_TOUT_THRHD_V << UART_RX_TOUT_THRHD_S)
#define UART_RX_TOUT_THRHD_V  0x000003FFU
#define UART_RX_TOUT_THRHD_S  17
/** UART_MEM_FORCE_PD : R/W; bitpos: [27]; default: 0;
 *  Set this bit to force power down UART memory.
 */
#define UART_MEM_FORCE_PD    (BIT(27))
#define UART_MEM_FORCE_PD_M  (UART_MEM_FORCE_PD_V << UART_MEM_FORCE_PD_S)
#define UART_MEM_FORCE_PD_V  0x00000001U
#define UART_MEM_FORCE_PD_S  27
/** UART_MEM_FORCE_PU : R/W; bitpos: [28]; default: 0;
 *  Set this bit to force power up UART memory.
 */
#define UART_MEM_FORCE_PU    (BIT(28))
#define UART_MEM_FORCE_PU_M  (UART_MEM_FORCE_PU_V << UART_MEM_FORCE_PU_S)
#define UART_MEM_FORCE_PU_V  0x00000001U
#define UART_MEM_FORCE_PU_S  28

/** UART_MEM_TX_STATUS_REG register
 *  Tx-FIFO write and read offset address.
 */
#define UART_MEM_TX_STATUS_REG(i) (REG_UART_BASE(i) + 0x64)
/** UART_APB_TX_WADDR : RO; bitpos: [9:0]; default: 0;
 *  This register stores the offset address in Tx-FIFO when software writes Tx-FIFO via
 *  APB.
 */
#define UART_APB_TX_WADDR    0x000003FFU
#define UART_APB_TX_WADDR_M  (UART_APB_TX_WADDR_V << UART_APB_TX_WADDR_S)
#define UART_APB_TX_WADDR_V  0x000003FFU
#define UART_APB_TX_WADDR_S  0
/** UART_TX_RADDR : RO; bitpos: [20:11]; default: 0;
 *  This register stores the offset address in Tx-FIFO when Tx-FSM reads data via
 *  Tx-FIFO_Ctrl.
 */
#define UART_TX_RADDR    0x000003FFU
#define UART_TX_RADDR_M  (UART_TX_RADDR_V << UART_TX_RADDR_S)
#define UART_TX_RADDR_V  0x000003FFU
#define UART_TX_RADDR_S  11

/** UART_MEM_RX_STATUS_REG register
 *  Rx-FIFO write and read offset address.
 */
#define UART_MEM_RX_STATUS_REG(i) (REG_UART_BASE(i) + 0x68)
/** UART_APB_RX_RADDR : RO; bitpos: [9:0]; default: 512;
 *  This register stores the offset address in RX-FIFO when software reads data from
 *  Rx-FIFO via APB. UART0 is 10'h200. UART1 is 10'h280. UART2 is 10'h300.
 */
#define UART_APB_RX_RADDR    0x000003FFU
#define UART_APB_RX_RADDR_M  (UART_APB_RX_RADDR_V << UART_APB_RX_RADDR_S)
#define UART_APB_RX_RADDR_V  0x000003FFU
#define UART_APB_RX_RADDR_S  0
/** UART_RX_WADDR : RO; bitpos: [20:11]; default: 512;
 *  This register stores the offset address in Rx-FIFO when Rx-FIFO_Ctrl writes
 *  Rx-FIFO. UART0 is 10'h200. UART1 is 10'h280. UART2 is 10'h300.
 */
#define UART_RX_WADDR    0x000003FFU
#define UART_RX_WADDR_M  (UART_RX_WADDR_V << UART_RX_WADDR_S)
#define UART_RX_WADDR_V  0x000003FFU
#define UART_RX_WADDR_S  11

/** UART_FSM_STATUS_REG register
 *  UART transmit and receive status.
 */
#define UART_FSM_STATUS_REG(i) (REG_UART_BASE(i) + 0x6c)
/** UART_ST_URX_OUT : RO; bitpos: [3:0]; default: 0;
 *  This is the status register of receiver.
 */
#define UART_ST_URX_OUT    0x0000000FU
#define UART_ST_URX_OUT_M  (UART_ST_URX_OUT_V << UART_ST_URX_OUT_S)
#define UART_ST_URX_OUT_V  0x0000000FU
#define UART_ST_URX_OUT_S  0
/** UART_ST_UTX_OUT : RO; bitpos: [7:4]; default: 0;
 *  This is the status register of transmitter.
 */
#define UART_ST_UTX_OUT    0x0000000FU
#define UART_ST_UTX_OUT_M  (UART_ST_UTX_OUT_V << UART_ST_UTX_OUT_S)
#define UART_ST_UTX_OUT_V  0x0000000FU
#define UART_ST_UTX_OUT_S  4

/** UART_POSPULSE_REG register
 *  Autobaud high pulse register
 */
#define UART_POSPULSE_REG(i) (REG_UART_BASE(i) + 0x70)
/** UART_POSEDGE_MIN_CNT : RO; bitpos: [11:0]; default: 4095;
 *  This register stores the minimal input clock count between two positive edges. It
 *  is used in boudrate-detect process.
 */
#define UART_POSEDGE_MIN_CNT    0x00000FFFU
#define UART_POSEDGE_MIN_CNT_M  (UART_POSEDGE_MIN_CNT_V << UART_POSEDGE_MIN_CNT_S)
#define UART_POSEDGE_MIN_CNT_V  0x00000FFFU
#define UART_POSEDGE_MIN_CNT_S  0

/** UART_NEGPULSE_REG register
 *  Autobaud low pulse register
 */
#define UART_NEGPULSE_REG(i) (REG_UART_BASE(i) + 0x74)
/** UART_NEGEDGE_MIN_CNT : RO; bitpos: [11:0]; default: 4095;
 *  This register stores the minimal input clock count between two negative edges. It
 *  is used in boudrate-detect process.
 */
#define UART_NEGEDGE_MIN_CNT    0x00000FFFU
#define UART_NEGEDGE_MIN_CNT_M  (UART_NEGEDGE_MIN_CNT_V << UART_NEGEDGE_MIN_CNT_S)
#define UART_NEGEDGE_MIN_CNT_V  0x00000FFFU
#define UART_NEGEDGE_MIN_CNT_S  0

/** UART_CLK_CONF_REG register
 *  UART core clock configuration
 */
#define UART_CLK_CONF_REG(i) (REG_UART_BASE(i) + 0x78)
/** UART_SCLK_DIV_B : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor.
 */
#define UART_SCLK_DIV_B    0x0000003FU
#define UART_SCLK_DIV_B_M  (UART_SCLK_DIV_B_V << UART_SCLK_DIV_B_S)
#define UART_SCLK_DIV_B_V  0x0000003FU
#define UART_SCLK_DIV_B_S  0
/** UART_SCLK_DIV_A : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor.
 */
#define UART_SCLK_DIV_A    0x0000003FU
#define UART_SCLK_DIV_A_M  (UART_SCLK_DIV_A_V << UART_SCLK_DIV_A_S)
#define UART_SCLK_DIV_A_V  0x0000003FU
#define UART_SCLK_DIV_A_S  6
/** UART_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 1;
 *  The integral part of the frequency divider factor.
 */
#define UART_SCLK_DIV_NUM    0x000000FFU
#define UART_SCLK_DIV_NUM_M  (UART_SCLK_DIV_NUM_V << UART_SCLK_DIV_NUM_S)
#define UART_SCLK_DIV_NUM_V  0x000000FFU
#define UART_SCLK_DIV_NUM_S  12
/** UART_SCLK_SEL : R/W; bitpos: [21:20]; default: 3;
 *  UART clock source select. 1: 80Mhz, 2: 8Mhz, 3: XTAL.
 */
#define UART_SCLK_SEL    0x00000003U
#define UART_SCLK_SEL_M  (UART_SCLK_SEL_V << UART_SCLK_SEL_S)
#define UART_SCLK_SEL_V  0x00000003U
#define UART_SCLK_SEL_S  20
/** UART_SCLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set this bit to enable UART Tx/Rx clock.
 */
#define UART_SCLK_EN    (BIT(22))
#define UART_SCLK_EN_M  (UART_SCLK_EN_V << UART_SCLK_EN_S)
#define UART_SCLK_EN_V  0x00000001U
#define UART_SCLK_EN_S  22
/** UART_RST_CORE : R/W; bitpos: [23]; default: 0;
 *  Write 1 then write 0 to this bit, reset UART Tx/Rx.
 */
#define UART_RST_CORE    (BIT(23))
#define UART_RST_CORE_M  (UART_RST_CORE_V << UART_RST_CORE_S)
#define UART_RST_CORE_V  0x00000001U
#define UART_RST_CORE_S  23
/** UART_TX_SCLK_EN : R/W; bitpos: [24]; default: 1;
 *  Set this bit to enable UART Tx clock.
 */
#define UART_TX_SCLK_EN    (BIT(24))
#define UART_TX_SCLK_EN_M  (UART_TX_SCLK_EN_V << UART_TX_SCLK_EN_S)
#define UART_TX_SCLK_EN_V  0x00000001U
#define UART_TX_SCLK_EN_S  24
/** UART_RX_SCLK_EN : R/W; bitpos: [25]; default: 1;
 *  Set this bit to enable UART Rx clock.
 */
#define UART_RX_SCLK_EN    (BIT(25))
#define UART_RX_SCLK_EN_M  (UART_RX_SCLK_EN_V << UART_RX_SCLK_EN_S)
#define UART_RX_SCLK_EN_V  0x00000001U
#define UART_RX_SCLK_EN_S  25
/** UART_TX_RST_CORE : R/W; bitpos: [26]; default: 0;
 *  Write 1 then write 0 to this bit, reset UART Tx.
 */
#define UART_TX_RST_CORE    (BIT(26))
#define UART_TX_RST_CORE_M  (UART_TX_RST_CORE_V << UART_TX_RST_CORE_S)
#define UART_TX_RST_CORE_V  0x00000001U
#define UART_TX_RST_CORE_S  26
/** UART_RX_RST_CORE : R/W; bitpos: [27]; default: 0;
 *  Write 1 then write 0 to this bit, reset UART Rx.
 */
#define UART_RX_RST_CORE    (BIT(27))
#define UART_RX_RST_CORE_M  (UART_RX_RST_CORE_V << UART_RX_RST_CORE_S)
#define UART_RX_RST_CORE_V  0x00000001U
#define UART_RX_RST_CORE_S  27

/** UART_DATE_REG register
 *  UART Version register
 */
#define UART_DATE_REG(i) (REG_UART_BASE(i) + 0x7c)
/** UART_DATE : R/W; bitpos: [31:0]; default: 33587824;
 *  This is the version register.
 */
#define UART_DATE    0xFFFFFFFFU
#define UART_DATE_M  (UART_DATE_V << UART_DATE_S)
#define UART_DATE_V  0xFFFFFFFFU
#define UART_DATE_S  0

/** UART_ID_REG register
 *  UART ID register
 */
#define UART_ID_REG(i) (REG_UART_BASE(i) + 0x80)
/** UART_ID : R/W; bitpos: [29:0]; default: 1280;
 *  This register is used to configure the uart_id.
 */
#define UART_ID    0x3FFFFFFFU
#define UART_ID_M  (UART_ID_V << UART_ID_S)
#define UART_ID_V  0x3FFFFFFFU
#define UART_ID_S  0
/** UART_HIGH_SPEED : R/W; bitpos: [30]; default: 1;
 *  This bit used to select synchronize mode. 1: Registers are auto synchronized into
 *  UART Core clock and UART core should be keep the same with APB clock. 0: After
 *  configure registers, software needs to write 1 to UART_REG_UPDATE to synchronize
 *  registers.
 */
#define UART_HIGH_SPEED    (BIT(30))
#define UART_HIGH_SPEED_M  (UART_HIGH_SPEED_V << UART_HIGH_SPEED_S)
#define UART_HIGH_SPEED_V  0x00000001U
#define UART_HIGH_SPEED_S  30
/** UART_REG_UPDATE : R/W/SC; bitpos: [31]; default: 0;
 *  Software write 1 would synchronize registers into UART Core clock domain and would
 *  be cleared by hardware after synchronization is done.
 */
#define UART_REG_UPDATE    (BIT(31))
#define UART_REG_UPDATE_M  (UART_REG_UPDATE_V << UART_REG_UPDATE_S)
#define UART_REG_UPDATE_V  0x00000001U
#define UART_REG_UPDATE_S  31

#ifdef __cplusplus
}
#endif
